apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    /*
     * Note: on LE Coded EVENT_ADDRESS is fired after TERM1 is received, so
     *       we are actually calculating relative to start of packet payload
     *       which is fine.
     */

    /* Adjust for receiving access address since this triggers EVENT_ADDRESS */
    end_time += ble_phy_mode_pdu_start_off(phy);
    /* Adjust for delay between actual access address RX and EVENT_ADDRESS */
    end_time += g_ble_phy_t_rxaddrdelay[phy];

    ble_phy_wfr_enable_at(end_time);
}

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
static uint32_t
ble_phy_get_ccm_datarate(void)
{
#if MYNEWT_VAL(BLE_LL_PHY)
    switch (g_ble_phy_data.phy_cur_phy_mode) {
    case BLE_PHY_MODE_1M:
        return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
    case BLE_PHY_MODE_2M:
        return CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    case BLE_PHY_MODE_CODED_125KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_125Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_125Kbps << CCM_MODE_DATARATE_Pos;
#endif
    case BLE_PHY_MODE_CODED_500KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_500Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_500Kbps << CCM_MODE_DATARATE_Pos;
#endif
#endif
    }

    assert(0);
    return 0;
#else
    return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
#endif
}
#endif

/**
 * Setup transceiver for receive.
 */
static void
ble_phy_rx_xcvr_setup(void)
{
    uint8_t *dptr;

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
#ifdef NRF54L_SERIES
        /* AAD length */
        g_ccm_job_list.in_alen = 1;
        g_ccm_job_list.in[0].p_buffer = (uint8_t *) &g_ccm_job_list.in_alen;
        g_ccm_job_list.in[0].size = sizeof(g_ccm_job_list.in_alen);
        g_ccm_job_list.in[0].attributes = 11;

        /* Encrypted message length LSB */
        g_ccm_job_list.in[1].p_buffer = ((uint8_t *)g_ble_phy_enc_buf) + 1;
        g_ccm_job_list.in[1].size = 1;
        g_ccm_job_list.in[1].attributes = 12;

        /* Encrypted message length MSB */
        g_ccm_job_list.in[2].p_buffer = &g_ccm_job_list.in_mlen_msb;
        g_ccm_job_list.in[2].size = sizeof(g_ccm_job_list.in_mlen_msb);
        g_ccm_job_list.in[2].attributes = 12;

        /* AAD */
        g_ccm_job_list.in[3].p_buffer = ((uint8_t *)g_ble_phy_enc_buf);
        g_ccm_job_list.in[3].size = 1;
        g_ccm_job_list.in[3].attributes = 13;

        /* Encrypted message */
        g_ccm_job_list.in[4].p_buffer = ((uint8_t *)g_ble_phy_enc_buf) + 3;
        g_ccm_job_list.in[4].size = NRF_MAXLEN;
        g_ccm_job_list.in[4].attributes = 14;

        /* Job list terminator */
        memset(&g_ccm_job_list.in[5], 0, sizeof(g_ccm_job_list.in[5]));

        /* AAD length */
        g_ccm_job_list.out[0].p_buffer = (uint8_t *) &g_ccm_job_list.out_alen;
        g_ccm_job_list.out[0].size = sizeof(g_ccm_job_list.out_alen);
        g_ccm_job_list.out[0].attributes = 11;

        /* Decrypted message length LSB */
        g_ccm_job_list.out[1].p_buffer = &dptr[1];
        g_ccm_job_list.out[1].size = 1;
        g_ccm_job_list.out[1].attributes = 12;

        /* Decrypted message length MSB */
        g_ccm_job_list.out[2].p_buffer = &g_ccm_job_list.out_mlen_msb;
        g_ccm_job_list.out[2].size = sizeof(g_ccm_job_list.out_mlen_msb);
        g_ccm_job_list.out[2].attributes = 12;

        /* AAD */
        g_ccm_job_list.out[3].p_buffer = &dptr[0];
        g_ccm_job_list.out[3].size = 1;
        g_ccm_job_list.out[3].attributes = 13;

        /* Decrypted message */
        g_ccm_job_list.out[4].p_buffer = &dptr[3];
        g_ccm_job_list.out[4].size = NRF_MAXLEN - 4;
        g_ccm_job_list.out[4].attributes = 14;

        /* Job list terminator */
        memset(&g_ccm_job_list.out[5], 0, sizeof(g_ccm_job_list.out[5]));

        NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->IN.PTR = (uint32_t)g_ccm_job_list.in;
        NRF_CCM->OUT.PTR = (uint32_t)g_ccm_job_list.out;

        NRF_CCM->MODE = (CCM_MODE_MACLEN_M4 << CCM_MODE_MACLEN_Pos) | CCM_MODE_MODE_Decryption |
                        ble_phy_get_ccm_datarate();

        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_END = 0;
#else
        NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->INPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUTPTR = (uint32_t)dptr;
        NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
        NRF_CCM->MODE = CCM_MODE_LENGTH_Msk | CCM_MODE_MODE_Decryption |
                                                    ble_phy_get_ccm_datarate();
        NRF_CCM->CNFPTR = (uint32_t)&g_nrf_ccm_data;
        NRF_CCM->SHORTS = 0;
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_ENDCRYPT = 0;
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_KSGEN);
#endif
        phy_ppi_radio_address_to_ccm_crypt_enable();
    } else {
        NRF_RADIO->PACKETPTR = (uint32_t)dptr;
    }
#else
    NRF_RADIO->PACKETPTR = (uint32_t)dptr;
#endif

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    if (g_ble_phy_data.phy_privacy) {
        NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Enabled;
#ifdef NRF54L_SERIES
        NRF_AAR->IN.PTR = (uint32_t)&g_nrf_irk_list[0];
        /* TODO(m): Find replacement for NRF_AAR->SCRATCHPTR */
#else
        NRF_AAR->IRKPTR = (uint32_t)&g_nrf_irk_list[0];
        NRF_AAR->SCRATCHPTR = (uint32_t)&g_ble_phy_data.phy_aar_scratch;
#endif
        NRF_AAR->EVENTS_END = 0;
        NRF_AAR->EVENTS_RESOLVED = 0;
        NRF_AAR->EVENTS_NOTRESOLVED = 0;
    } else {
        if (g_ble_phy_data.phy_encrypted == 0) {
            NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Disabled;
        }
    }
#endif

    /* Turn off trigger TXEN on output compare match and AAR on bcmatch */
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    //phy_ppi_radio_bcmatch_to_aar_start_disable(); TODO(m): this was disabling CCM RADIO SUBSCRIBTION because peripherals share memory. think later what to do with it

    /* Reset the rx started flag. Used for the wait for response */
    g_ble_phy_data.phy_rx_started = 0;
    g_ble_phy_data.phy_state = BLE_PHY_STATE_RX;

#if MYNEWT_VAL(BLE_LL_PHY)
    /*
     * On Coded PHY there are CI and TERM1 fields before PDU starts so we need
     * to take this into account when setting up BCC.
     */
    if (g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_125KBPS ||
            g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_500KBPS) {
        g_ble_phy_data.phy_bcc_offset = 5;
    } else {
        g_ble_phy_data.phy_bcc_offset = 0;
    }
#else
    g_ble_phy_data.phy_bcc_offset = 0;
#endif

    /* I want to know when 1st byte received (after address) */
    nrf_radio_bcc_set(NRF_RADIO, 8 + g_ble_phy_data.phy_bcc_offset); /* in bits */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_DEVMATCH = 0;
    NRF_RADIO->EVENTS_BCMATCH = 0;
#ifndef NRF54L_SERIES
    NRF_RADIO->EVENTS_RSSIEND = 0;
#endif
    NRF_RADIO->EVENTS_CRCOK = 0;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
#ifdef NRF54L_SERIES
    NRF_RADIO->SHORTS |= RADIO_SHORTS_PHYEND_DISABLE_Msk;
#else
    NRF_RADIO->SHORTS |= RADIO_SHORTS_END_DISABLE_Msk |
                         RADIO_SHORTS_DISABLED_RSSISTOP_Msk;
#endif
    nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_ADDRESS_Msk |
                                    RADIO_INTENSET_DISABLED_Msk);
}

uint32_t
ble_phy_transition_anchor_get(uint8_t tifs_anchor, uint8_t phy_state, uint8_t phy_mode)
{
    uint32_t time;

    if (tifs_anchor == PHY_TRANS_ANCHOR_END) {
        /* END timestamp is captured in CC[2] */
        time = NRF_TIMER0->CC[2];

